<?php
\Config::set('filesystems.disks.public.url', url('storage'));
//return dd(config('filesystems.disks.public.url'));
////// direction Function /////////////////////
app()->singleton('direction', function () {
		if (app('l') == 'ar') {
			return '-rtl';
		}
	});
////// direction Function /////////////////////

//////  upload Function /////////////////////
if (!function_exists('it')) {
	function it() {
		return new \App\Http\Controllers\FileUploader;
	}
}
//////  upload Function /////////////////////

////// Admin Url Function /////////////////////
if (!function_exists('aurl')) {
	function aurl($link) {
		if (substr($link, 0, 1) == '/') {
			return url(app('admin').$link);
		} else {
			return url(app('admin').'/'.$link);
		}
	}
}
////// Admin Url Function /////////////////////

////// Admin Url Function /////////////////////
if (!function_exists('admin')) {
	function admin() {
		return auth()->guard('admin');
	}
}
////// Admin Url Function /////////////////////

////// Admin Url Function /////////////////////
if (!function_exists('active_link')) {
	function active_link($segment, $class = null) {
		if ($segment == null and request()->segment(2) == null) {
			return $class;
		} elseif (preg_match('/'.$segment.'/i', request()->segment(2))) {
			if ($class != null || $class != 'block') {
				if ($segment != null) {
					return $class;
				}
			} else {
				if ($class == 'block') {
					return 'display:block';
				} else {
					return 'display:none';
				}
			}
		}
	}
}


// get unwatched messages 

if(!function_exists('messages')){
	function messages($type = 'countAll'){
		if($type == 'countAll'){
			return App\Message::get()->count();
		}elseif($type == 'countInactive'){
			return App\Message::where('watched', 'no')->get()->count();
		}else{
                  return App\Message::where('watched', 'no')->get();
            }
	}
}

// get notifications
if(!function_exists('notifications')){
      function notifications ($text = null){
            if($text == 'count'){
                  return App\Building::where('active', '0')->get()->count();
            }else{
                  return App\Building::where('active', '0')->orderBy('id', 'desc')->take(10)->get();
            }
      }
}
////// Admin Url Function /////////////////////

////// User Url Function //////////////////////
if(!function_exists('getLang')){
	function getLang(){
		if(session()->has('lang')){ // check if session has language 
			if(session('lang') == 'en'){
				return "en" ; 
			}else{
				return "ar"; // default
			}
		}
	}
}
/////// User Url Function 

// Get Website Settings
if(!function_exists('setting')){
	function setting(){
		return \App\Setting::orderBy('id', 'desc')->first();
	}
}
// nice names 
if(!function_exists("nicename")){
	function nicename($text){
		$nicenames = [
			'ad_status' => 'الحالة',
			'ad_price'  => 'سعر الشقة',
			'ad_keywords'=> 'الكلمات المفتاحية',
			'ad_town'   => 'المدينة',
			'ad_space'  => 'مساحة العقار',
			'ad_room_count' => 'عدد الغرف',
			'ad_bathroom_count' => 'الحمامات',
			'ad_kitchen' => 'المطبخ',
			'ad_reseption' => 'الريسيبشن',
			'price-from'   => 'السعر من',
			'price-to'     => 'السعر إلى',
                  'ad_sort'      => 'نوع العقار',
                  'ad_furnished' => 'الحالة',

		]; 
		return $nicenames[$text];
	}
}
//set active link
if(!function_exists('setActive')){
	function setActive($segment1 = '', $segment2 = '', $class = 'active'){
		if(request()->segment(1) == $segment1 && $segment2 == ''){
			return $class ; 
		}elseif(request()->segment(1) == null && $segment1== '' && $segment2 == ''){
			return $class; 
		}elseif($segment1 != '' && $segment2 != '' && $segment1 == request()->segment(1) && $segment2 == request()->segment(2)){
			return $class; 
		}
}


// all towns 
if(!function_exists('towns')){
	function towns(){
			$array = [
			""=>'المنطقة/الحي',
            'ابو رواش'=>'ابو رواش',
            'اكتوبر'=>'6 اكتوبر',
            'اطفيح'=>'اطفيح',
            'البدرشين'=>'البدرشين',
            'البساتين'=>'البساتين',
            'البستان'=>'البستان',
            'البشاير'=>'البشاير',
            'الجيزة'=>'الجيزة',
            'الحوامدية'=>'الحوامدية',
            'الخليفة'=>'الخليفة',
            'الدقي'=>'الدقي',
            'الروضه'=>'الروضه',
            'الزاوية الحمراء'=>'الزاوية الحمراء',
            'الزيتون'=>'الزيتون',
            'الساحل'=>'الساحل',
            'السلام'=>'السلام',
            'السيدة زينب'=>'السيدة زينب',
            'الشرابية'=>'الشرابية',
            'العجوزة'=>'العجوزة',
            'العمرانية'=>'العمرانية',
            'العياط'=>'العياط',
            'اللشت'=>'اللشت',
            'المرج'=>'المرج',
            'المطرية'=>'المطرية',
            'المقطم'=>'المقطم',
            'المهندسين'=>'المهندسين',
            'الموسكي'=>'الموسكي',
            'النزهة'=>'النزهة',
            'الهرم'=>'الهرم',
            'الوايلي'=>'الوايلي',
            'الوحدات البحرية'=>'الوحدات البحرية',
            'الوراق اوسيم'=>'الوراق اوسيم',
            'إمبابة'=>'إمبابة',
            'أطفيح'=>'أطفيح',
            'اب الشعرية'=>'باب الشعرية',
            'الم هيلز'=>'بالم هيلز',
            'ولاق'=>'بولاق',
            'بولاق الكدرور'=>'بولاق الكدرور',
            'بيفيرلي هيلز القاهرة'=>'بيفيرلي هيلز القاهرة',
            'حدائق القبة'=>'حدائق القبة',
            'حي الاشجار'=>'حي الاشجار',
            'دار السلام'=>'دار السلام',
            'دريم لاند'=>'دريم لاند',
            'روض الفرج'=>'روض الفرج',
            'رويال غاردنز'=>'رويال غاردنز',
            'رويال هيلز'=>'رويال هيلز',
            'سقارة'=>'سقارة',
            'صفوة سيتي'=>'صفوة سيتي',
            'عابدين'=>'عابدين',
            'عين شمس'=>'عين شمس',
            'غرب'=>'غرب',
            'كرداسة'=>'كرداسة',
            'كهشور'=>'كهشور',
            'مدينة نصر'=>'مدينة نصر',
            'مصر الجديدة'=>'مصر الجديدة',
            'مصر القديمة'=>'مصر القديمة',
            'منشأة ناصر'=>'منشأة ناصر',
            'منف'=>'منف',
            'مينا غاردن سيتي'=>'مينا غاردن سيتي',
            'نيو جيزة'=>'نيو جيزة',
            'هرم ستي'=>'هرم ستي',
            'حدائق الاهرام'=>'حدائق الاهرام',
            'القاهرة الجديدة'=>'القاهرة الجديدة',
            'سته أكتوبر'=>'سته أكتوبر',
            'مدينة الشروق'=>'مدينة الشروق',
            'عباس العقاد'=>'عباس العقاد',
            'العجمي'=>'العجمي',
            'مدينه بدر'=>'مدينه بدر',
            'فيصل'=>'فيصل',
            'التجمع الخامس'=>'التجمع الخامس',
            'حدائق اكتوبر'=>'حدائق اكتوبر',
            'مدينه نصر'=>'مدينه نصر',
            'مكرم عبيد مدينة نصر'=>'مكرم عبيد مدينة نصر',
            'الحى الرابع'=>'الحى الرابع',
            'سته اكتوبر'=>'سته اكتوبر',
            'المعادى الجديدة'=>'المعادى الجديدة',
            'اكتوبر'=>'اكتوبر',
            'زهراء المعادى'=>'زهراء المعادى',
            'مصر الجديده'=>'مصر الجديده',
            'المعادي'=>'المعادي',
            'المعادى'=>'المعادى',
            'السادس من اكتوبر'=>'السادس من اكتوبر',
            'الشماليات'=>'الشماليات',
            'اسماعليه'=>'اسماعليه',
            'الشيخ زايد الحى السادس عشر'=>'الشيخ زايد الحى السادس عشر',
            'العبور'=>'العبور',
            'حى المخابرات اكتوبر'=>'حى المخابرات اكتوبر',
            'الشروق'=>'الشروق',
            'القاهره الجديده'=>'القاهره الجديده',
            'شرم الشيخ'=>'شرم الشيخ',
            'الحى العاشر'=>'الحى العاشر',
            'الزمالك'=>'الزمالك',
            'عزبة النخل'=>'عزبة النخل',
            'جسر السويس'=>'جسر السويس',
            'شبرا الخيمة'=>'شبرا الخيمة',
            'بدر'=>'بدر',
            'مدينة السلام'=>'مدينة السلام',
            'ارض الجولف'=>'ارض الجولف',
            'الياسمين'=>'الياسمين',
            'النعام'=>'النعام',
            'العباسية'=>'العباسية',
            'التحرير'=>'التحرير',
            'حدائق حلوان'=>'حدائق حلوان',
            'الشيخ زايد'=>'الشيخ زايد',
            'الساحل الشمالي'=>'الساحل الشمالي',
            'حي الأشجار'=>'حي الأشجار',
            'الغردقة'=>'الغردقة',
            'مدينة العبور'=>'مدينة العبور',
            'العين السخنه'=>'العين السخنه',
            'المنيب'=>'المنيب',
            'دمياط'=>'دمياط',
            'الرحاب'=>'الرحاب',
            'جمال عبد الناصر'=>'جمال عبد الناصر',
            'وادي النطون'=>'وادي النطون',
            'حلوان'=>'حلوان',
            'العجمى'=>'العجمى',
            'سوهاج'=>'سوهاج',
            'الدقى'=>'الدقى',
            'حدائق الأهرام'=>'حدائق الأهرام',
            'المريوطية'=>'المريوطية',
            'شبرا'=>'شبرا',
            'مدينة اكتوبر'=>'مدينة اكتوبر',
            'جمصة'=>'جمصة',
            'منتجع السليمانيه'=>'منتجع السليمانيه',
            'فينيسيا'=>'فينيسيا',
            'التجمع'=>'التجمع',
            'سيدى عبدالرحمن - الساحل الشمالى'=>'سيدى عبدالرحمن - الساحل الشمالى',
            'كاليبسو '=>'كاليبسو ',
            '6اكتوبر '=>'6اكتوبر ',
            'وسط القاهرة'=>'وسط القاهرة',
            'الغردقه'=>'الغردقه',
            'مساكن شيراتون'=>'مساكن شيراتون',
            'مدينة الشروق'=>'مدينة الشروق',
            'حدائق القبة'=>'حدائق القبة',
            'وادي النطرون'=>'وادي النطرون',
            'خليج راس الحكمه - مطروح'=>'خليج راس الحكمه - مطروح',
            'مدينه العبور'=>'مدينه العبور',
            'مكرم عبيد'=>'مكرم عبيد',
            'العجمى'=>'العجمى',
            'العاشر'=>'العاشر',
            'امام مارينا 7 - الساحل الشمالى'=>'امام مارينا 7 - الساحل الشمالى',
            'جمال عبد الناصر'=>'جمال عبد الناصر',
            'بلولاجون'=>'بلولاجون',
            'زهراء المعادى'=>'زهراء المعادى',
            'السادس من اكتوبر'=>'السادس من اكتوبر',
            'المريوطية'=>'المريوطية',
            'وسط البلد القاهرة'=>'وسط البلد القاهرة',
            'الصف'=>'الصف',
            'طريق مصر اسكندرية الصحراوى '=>'طريق مصر اسكندرية الصحراوى ',
            'الساحل الشمالى - ماونتن فيو'=>'الساحل الشمالى - ماونتن فيو',
            'وسط البلد - القاهرة'=>'وسط البلد - القاهرة',
            'بركة السبع'=>'بركة السبع',
            'بلبيس '=>'بلبيس ',
            'ف الكيلو 64 من مدينه راس سدر - جنوب سيناء '=>'ف الكيلو 64 من مدينه راس سدر - جنوب سيناء ',
            'الحى الاول'=>'الحى الاول',
            'مرسى علم'=>'مرسى علم',
            'غرب سوميد '=>'غرب سوميد ',
            'التجمع الاول'=>'التجمع الاول',
            'النزهة الجديدة 2'=>'النزهة الجديدة 2',
            'النزهة'=>'النزهة',
            'العباسبة'=>'العباسبة',
            'حمامات القبة'=>'حمامات القبة',
            'بيفرلى هيلز'=>'بيفرلى هيلز',
            'مدينة بدر'=>'مدينة بدر',
            'النزهه'=>'النزهه',
            'السيدة زينب'=>'السيدة زينب',
            'العين السخنه - السويس'=>'العين السخنه - السويس',
            'راس صدر'=>'راس صدر',
            'مدينه الشروق'=>'مدينه الشروق',
            'منطقة العبور'=>'منطقة العبور',
            'مرسي مطروح'=>'مرسي مطروح',
            'راس سدر - جنوب سيناء'=>'راس سدر - جنوب سيناء',
            'الهانوفيل'=>'الهانوفيل',
             'هليوبوليس الجديدة'=>'هليوبوليس الجديدة',
            'القادسيه'=>'القادسيه',
            'طريق مصر الفيوم '=>'طريق مصر الفيوم ',
            'قصر النيل'=>'قصر النيل',
            'مدينة العاشر من رمضان'=>'مدينة العاشر من رمضان',
            'القاهره والجيزه '=>'القاهره والجيزه ',
            'دمنهور'=>'دمنهور',
            'مدينة السادات'=>'مدينة السادات',
            'بشتيل'=>'بشتيل',
            'بدر '=>'بدر ',
            'مصر'=>'مصر',
            'جسر السويس الجديدة'=>'جسر السويس الجديدة',
            'جنوب سينا راس سدر'=>'جنوب سينا راس سدر',
            'شبين الكوم'=>'شبين الكوم',
            'المعادى الجديده '=>'المعادى الجديده ',
            'النوبارية'=>'النوبارية',
            'السادات'=>'السادات',
            'طنطا'=>'طنطا',
            'الشيخ زابد'=>'الشيخ زابد',
            'مطروح العلمين'=>'مطروح العلمين',
            'طريق الفيوم'=>'طريق الفيوم',
            'شارع مراد'=>'شارع مراد',
            'شارع السودان'=>'شارع السودان',
            'شارع البحر الاعظم'=>'شارع البحر الاعظم',
            'مدينة نصر '=>'مدينة نصر ',
            'القادسية'=>'القادسية',
            'سيوة'=>'سيوة',
            'جنوب سيناء'=>'جنوب سيناء',
            'بجوار مدينة السادات '=>'بجوار مدينة السادات ',
            'مدينه بدر'=>'مدينه بدر',
            'العاصمة الادارية الجديدة'=>'العاصمة الادارية الجديدة',
            'كفر الشيخ'=>'كفر الشيخ',
            'عجيبة مطروح'=>'عجيبة مطروح',
            'قباء '=>'قباء '
			];
			return $array;
	

		}
	}

	if(!function_exists('sorts')){
		function sorts(){
			$array = [
				"" => 'نوع العقار',
	            "إيجار" => 'إيجار ',
	            "تمليك" => 'تمليك'
			];

			return $array; 
		}
	}

	if(!function_exists('statuses')){
		function statuses(){
			$array = [
				""                => 'حالة العقار',
				"بدون تشطيب"  =>'بدون تشطيب',
		        "نصف تشطيب"  =>'نصف تشطيب',
		        "تشطيب كامل"  =>'تشطيب كامل',
		        "تشطيب لوكس"  =>'تشطيب لوكس',  
		        "تشطيب سوبر لوكس"  =>'تشطيب سوبر لوكس', 
		        "تشطيب ألترا لوكس"  =>'تشطيب ألترا لوكس' 
			];
			return $array; 
		}
	}
}


